{
    "model_type": "layoutlmv3",
    "architectures": [
        "LayoutLMv3ForTokenClassification"
    ],
    "hidden_size": 768,
    "num_hidden_layers": 12,
    "num_attention_heads": 12,
    "intermediate_size": 3072,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "attention_probs_dropout_prob": 0.1,
    "max_position_embeddings": 512,
    "type_vocab_size": 2,
    "initializer_range": 0.02,
    "layer_norm_eps": 1e-12,
    "pad_token_id": 0,
    "vocab_size": 30522,
    "coordinate_size": 128,
    "shape_size": 128,
    "has_relative_attention_bias": true,
    "has_spatial_attention_bias": true,
    "has_visual_segment_embedding": true,
    "image_feature_pool_shape": [
        7,
        7,
        256
    ],
    "coordinate_size": 128,
    "fast_qkv": false,
    "max_2d_position_embeddings": 1024
}